# Analyzing CIA Factbook Data Using SQL

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [8]:
%%sql
SELECT * 
    FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Minimum population
Maximum population
Minimum population growth
Maximum population growth

In [9]:
%%sql
SELECT MIN(population) AS Min_pop, MAX(population) AS Max_pop, MIN(population_growth) AS Min_growth, MAX (population_growth) AS Max_growth
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

Countries with the minimum population.

In [18]:
%%sql
SELECT name AS Country
    FROM facts
WHERE population = (SELECT MIN(population) FROM facts);

Done.

[('Antarctica',)]

Countries with the maximum population.

In [17]:
%%sql
SELECT name AS Country
    FROM facts
WHERE population = (SELECT MAX(population) FROM facts);

Done.

[('World',)]

Without Outliers (Word / Antarctica)
Minimum population
Maximum population
Minimum population growth
Maximum population growth

In [4]:
%%sql
SELECT MIN(population) AS Min_pop, MAX(population) AS Max_pop, MIN(population_growth) AS Min_growth, MAX (population_growth) AS Max_growth
    FROM facts
WHERE name <> 'World' AND name <> "Antarctica";

Done.

[(48, 1367485388, 0.0, 4.02)]

Average value for the following columns:

population
area

In [8]:
%%sql
SELECT CAST(AVG(population) AS INT) AS Mean_pop, CAST(AVG(area) AS INT) AS Mean_area
    FROM facts
WHERE name <> 'World' AND name <> "Antarctica";

Done.

[(32377011, 555093)]

countries meeting both of the following criteria:
The population is above average.
The area is below average.

In [5]:
%%sql

SELECT name AS 'Country with above averga pop. / area'
    FROM facts
WHERE population > (SELECT AVG(population) FROM facts)
AND area > (SELECT AVG(area) FROM facts);

Done.

[('Brazil',),
 ('China',),
 ('Congo, Democratic Republic of the',),
 ('Egypt',),
 ('Ethiopia',),
 ('France',),
 ('India',),
 ('Indonesia',),
 ('Iran',),
 ('Mexico',),
 ('Nigeria',),
 ('Pakistan',),
 ('Russia',),
 ('Turkey',),
 ('United States',),
 ('European Union',)]